LuanVan_TN_2023 (3)/LuanVan_TN_2023/app/Controllers/CartController.php

    public function index()
    {
        $cart_id = session()->get('cart_id');
        $carts_id = session()->get('carts_id');
        $customerID = session()->get('id');
        $cartModel = new CartModel();
        $cartItems = $cartModel
            ->where('ma_don_hang', $carts_id)
            ->where('ma_khach_hang', $customerID)
            ->findAll();
        $carts = $cartModel->where('ma_khach_hang', $customerID)
            ->where('ma_don_hang', $carts_id)
            ->first();
        $cartss = $cartModel->where('ma_don_hang', $cart_id)->first();
---
SELECT *
FROM `donhang`
WHERE `ma_don_hang` = 237
AND `ma_khach_hang` = '29'
SELECT *
FROM `donhang`
WHERE `ma_khach_hang` = '29'
AND `ma_don_hang` = 237
 LIMIT 1
SELECT *
FROM `donhang`
WHERE `ma_don_hang` = 238
 LIMIT 1