LuanVan_TN_2023 (3)/LuanVan_TN_2023/app/Controllers/OrderContrroller.php

SELECT *
FROM `donhang`
WHERE `ma_don_hang` = '236'
 LIMIT 1
---
    public function huyDonHang()
    {
        $ID = $this->request->getUri()->getSegment(4);
        $cartModel = new CartModel();
        $order = $cartModel->where('ma_don_hang', $ID)->first();

SELECT *
FROM `donhang`
WHERE `ma_don_hang` = '236'
AND `tong_tien` IS NOT NULL
AND `payment_method` IS NOT NULL
AND `ma_khach_hang` = '29'
SELECT *
FROM `donhang`
WHERE `ma_don_hang` = '236'
 LIMIT 1
SELECT *
FROM `Book`
WHERE `ma_sach` = '1'
 LIMIT 1
---
    public function detail()
    {
        $ID = $this->request->getUri()->getSegment(4);
        $customerID = session()->get('id');
        $cartModel = new CartModel();
        $cartItems = $cartModel
            ->where('ma_don_hang', $ID)
            ->where('tong_tien IS NOT NULL')
            ->where('payment_method IS NOT NULL')
            ->where('ma_khach_hang', $customerID)
            ->findAll();
        if ($cartItems) {
            $carts = $cartModel->where('ma_don_hang', $ID)
                ->first();
            $productModel = new BookModel();
            $cartdetailmodel = new DetailCartModel();
            $cart = []; // Mảng lưu trữ các sản phẩm
            $bookCount = 0; // Số lượng các loại sách trong giỏ hàng
            if ($cartItems) {
                $bookIDs = []; // Mảng lưu trữ các mã sách đã có trong giỏ hàng
                foreach ($cartItems as $item) {

                    $cartdetais = $cartdetailmodel->where('ma_don_hang', $ID)->findAll();

                    foreach ($cartdetais as $cartdetail) {

                        $product = $productModel->where('ma_sach', $cartdetail['ma_sach'])->first();

SELECT *
FROM `donhang`
WHERE `ma_don_hang` = 237
AND `ma_khach_hang` = '29'
SELECT *
FROM `donhang`
WHERE `ma_khach_hang` = '29'
 LIMIT 1
SELECT *
FROM `donhang`
WHERE `ma_don_hang` = 238
 LIMIT 1
---
    public function cart()
    {
        $cart_id = session()->get('cart_id');
        $carts_id = session()->get('carts_id');
        $customerID = session()->get('id');
        $cartModel = new CartModel();
        $cartItems = $cartModel
            ->where('ma_don_hang', $carts_id)
            ->where('ma_khach_hang', $customerID)
            ->findAll();
        $carts = $cartModel->where('ma_khach_hang', $customerID)->first();
        $cartss = $cartModel->where('ma_don_hang', $cart_id)->first();