LuanVan_TN_2023 (3)/LuanVan_TN_2023/app/Controllers/Admin/Home.php

    public function index()
    {
        $cartModel = new CartModel();
        $cart = $cartModel->where('trang_thai_don_hang', 3)->countAllResults();
        $carts = $cartModel->where('trang_thai_don_hang', 2)->countAllResults();
        $cartss = $cartModel->where('trang_thai_don_hang', 4)->countAllResults();
        $cartsss = $cartModel->where('tong_tien IS NOT NULL')
            ->where('payment_method IS NOT NULL')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `donhang`
WHERE `trang_thai_don_hang` = 3
SELECT COUNT(*) AS `numrows`
FROM `donhang`
WHERE `trang_thai_don_hang` = 2
SELECT COUNT(*) AS `numrows`
FROM `donhang`
WHERE `trang_thai_don_hang` = 4
SELECT COUNT(*) AS `numrows`
FROM `donhang`
WHERE `tong_tien` IS NOT NULL
AND `payment_method` IS NOT NULL